GetColdI
Syntax
SapObject.SapModel.PropFrame.GetColdI
VB6 Procedure
Function GetColdI(ByVal Name As String, ByRef FileName As String, ByRef MatProp As String, ByRef t3 As Double, ByRef t2 As Double, ByRef t2b As Double, ByRef Thickness As Double, ByRef Radius As Double, ByRef Color As Long, ByRef Notes As String, ByRef GUID As String) As Long
Parameters
Name
The name of an existing cold formed I-shape frame section property.
FileName
If the section property was imported from a property file, this is the name of that file. If the section property was not imported, this item is blank.
MatProp
The name of the material property for the section.
t3
The section depth. [L]
t2
The section top flange width. [L]
t2b
The section bottom flange width. [L]
Thickness
The section thickness. [L]
Radius
The corner radius, if any. [L]
Color
The display color assigned to the section.
Notes
The notes, if any, assigned to the section.
GUID
The GUID (global unique identifier), if any, assigned to the section.
Remarks
This function retrieves frame section property data for a cold formed I-shape frame section.
The function returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetFramePropColdI()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Name As String
 Dim FileName As String
 Dim MatProp As String
 Dim t3 As Double
 Dim t2 As Double
 Dim t2b As Double
 Dim Thickness As Double
 Dim Radius As Double
 Dim Color As Long
 Dim Notes As String
 Dim GUID As String
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add cold formed material
 ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_COLDFORMED, , , , MATERIAL_COLDFORMED_SUBTYPE_ASTM_A653SQGr50)
 'set new frame section property
 ret = SapModel.PropFrame.SetColdI("CI1", Name, 10, 3.2, 2.5, 0.08, 0.3)
 'get frame section property data
 ret = SapModel.PropFrame.GetColdI("CI1", FileName, MatProp, t3, t2, t2b, Thickness , Radius, Color, Notes, GUID)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 22.2.0.
See Also
SetColdI